{
    "Archives_edgar_data_1995704_000164117225020367_form6-k.htm": "\n\n     \n\n\n\n \n\n \n\n\n\n \n\nUNITED\nSTATES\n\nSECURITIES\nAND EXCHANGE COMMISSION\n\nWashington,\nD.C. 20549\n\n \n\nFORM\n6-K\n\n \n\nREPORT\nOF FOREIGN PRIVATE ISSUER\n\nPURSUANT\nTO RULE 13a-16 OR 15d-16\n\nUNDER\nTHE SECURITIES EXCHANGE ACT OF 1934\n\n \n\nFor\nthe month of July 2025\n\n \n\nCommission\nFile Number: 001-42288\n\n \n\nCuprina\nHoldings (Cayman) Limited\n\n(Registrant’s\nName)\n\n \n\nc/o\nBlk 1090 Lower Delta Road #06-08\n\nSingapore\n169201\n\n(Address\nof principal executive office)\n\n \n\n\n\n\n\nIndicate\nby check mark whether the registrant files or will file annual reports under cover of Form 20-F or Form 40-F.\n\n \n\n\n\n  Form 20-F ☒\n  \n     \n  Form 40-F ☐\n\n\n\n \n\n \n\n\n\n \n\n",
    "Archives_edgar_data_1995704_000164117225020367_ex99-1.htm": "\n\n     \n\n\n\n \n\nExhibit\n99.1\n\n \n\n\n\n\n\n \n\nCuprina\nAppoints Dr. Ronald Sherman, Leader in Maggot Debridement\n\nTherapy, as Medical and Scientific Director; Secures \n\nFDA-approved\nMedical Maggot License for U.S. Market\n\n \n\nSINGAPORE,\nJuly 21, 2025 – Cuprina Holdings (Cayman) Limited (Nasdaq: CUPR) (“CUPR” or “the Company”),\na biomedical and biotechnology company dedicated to the development and commercialization of products for the management of chronic wounds\nand infertility, as well as cosmeceuticals for the health and beauty sector, today announced that Dr. Ronald A. Sherman, a leading innovator\nin the use of medical maggots to treat chronic wounds, has agreed to join the Company as Medical and Scientific Director in September\n2025. \n\n \n\nCuprina\nalso announced it has signed an agreement with Dr. Sherman licensing his 2004 FDA clearance to market Lucilia sericata Medical\nMaggotsTM, the first such marketing clearance in US history. This agreement gives Cuprina the right to manufacture, sell,\nuse and distribute these maggots and associated dressings for use in maggot debridement therapy (MDT) in the United States.\n\n \n\nUpon\njoining Cuprina, Dr. Sherman’s roles and responsibilities are expected to include the following:\n\n \n\nClinical\nLeadership on Bio-Therapeutics:\n\n \n\n\n●Serve\n                                            as clinical and key opinion leader on maggot therapy, leech therapy, ichthyotherapy, and\n                                            other company bio-therapeutic initiatives; and\n\n●Provide\n                                            mentorship, insights, and scientific guidance to Cuprina and affiliated clinicians in adopting\n                                            and expanding bio-therapeutic practices.\n\n \n\nTraining,\nEducation and Awareness:\n\n \n\n\n●Co-develop,\n                                            with Cuprina, a structured training and certification framework for bio-therapeutics;\n\n ●Assist in designing the syllabus and modules for education and certification; and\n\n●Represent\n                                            Cuprina as a speaker at conferences, seminars, and public events to raise awareness and advance\n                                            the adoption of bio-therapeutics.\n\n ",
    "Archives_edgar_data_1995704_000164117225017256_form6-k.htm": "\n\n     \n\n\n\n \n\n\n\n \n\n\n\n \n\nUNITED\nSTATES\n\nSECURITIES\nAND EXCHANGE COMMISSION\n\nWashington,\nD.C. 20549\n\n \n\nFORM\n6-K\n\n \n\nREPORT\nOF FOREIGN PRIVATE ISSUER\nPURSUANT TO RULE 13a-16 OR 15d-16\nUNDER THE SECURITIES EXCHANGE ACT OF 1934\n\n \n\nFor\nthe month of July 2025\n\n \n\nCommission\nFile Number: 001-42288\n\n \n\nCuprina\nHoldings (Cayman) Limited\n\n(Registrant’s\nName)\n\n \n\nc/o\nBlk 1090 Lower Delta Road #06-08\n\nSingapore\n169201\n\n(Address\nof Principal Executive Offices)\n\n \n\nIndicate\nby check mark whether the registrant files or will file annual reports under cover Form 20-F or Form 40-F.\n\n \n\n\n  \n    Form\n    20-F ☒\n     \n    Form\n    40-F ☐\n  \n \n\nIndicate\nby check mark if the registrant is submitting the Form 6-K in paper as permitted by Regulation S-T Rule 101(b)(1): ☐\n\n \n\nIndicate\nby check mark if the registrant is submitting the Form 6-K in paper as permitted by Regulation S-T Rule 101(b)(7): ☐\n\n\n\n \n\n \n\n\n\n ",
    "Archives_edgar_data_1995704_000164117225017049_form6-k.htm": "\n\n     \n\n\n\n \n\n\n\n \n\n \n\nUNITED\nSTATES\n\nSECURITIES\nAND EXCHANGE COMMISSION\n\nWashington,\nD.C. 20549\n\n \n\nFORM\n6-K\n\n \n\nREPORT\nOF FOREIGN PRIVATE ISSUER\nPURSUANT TO RULE 13a-16 OR 15d-16\nUNDER THE SECURITIES EXCHANGE ACT OF 1934\n\n \n\nFor\nthe month of June 2025\n\n \n\nCommission\nFile Number: 001-42288\n\n \n\nCuprina\nHoldings (Cayman) Limited\n\n(Registrant’s\nName)\n\n \n\nc/o\nBlk 1090 Lower Delta Road #06-08\n\nSingapore\n169201\n\n(Address\nof Principal Executive Offices)\n\n \n\nIndicate\nby check mark whether the registrant files or will file annual reports under cover Form 20-F or Form 40-F.\n\n \n\n\n  \n    Form\n    20-F ☒\n     \n    Form\n    40-F ☐\n  \n \n\nIndicate\nby check mark if the registrant is submitting the Form 6-K in paper as permitted by Regulation S-T Rule 101(b)(1): ☐\n\n \n\nIndicate\nby check mark if the registrant is submitting the Form 6-K in paper as permitted by Regulation S-T Rule 101(b)(7): ☐\n\n \n\n\n\n \n\n \n\n",
    "Archives_edgar_data_1995704_000164117225017049_ex99-1.htm": "\n\n     \n\n\n\n \n\nExhibit\n99.1\n\n \n\n\n\n \n\nCuprina\nProvides Update on Research Studies\nwith Three Leading Education Institutes\n\n \n\nSINGAPORE,\nJune 30, 2025 -- Cuprina Holdings (Cayman) Limited (Nasdaq: CUPR) (“Cuprina” or “the Company”),\na biomedical and biotechnology company dedicated to the development and commercialization of products for the management of chronic wounds\nand infertility, as well as cosmeceuticals for the health and beauty sector, today provided an update on progress achieved in relation\nto three studies carried out with institutes of higher learning. The studies, each one year in length, were aimed at helping Cuprina\nand these institutes jointly produce collagen peptide molecules derived from American bullfrog skin. These peptides, as well as their\nshort chain variants, are widely considered to be useful in the manufacture of an array of medical, pharmaceutical, nutraceutical and\ncosmetic products.\n\n \n\nThe\nfirst study was performed pursuant to a consultancy proposal (“CP”) signed in February 2024 with Republic Polytechnic (“RP”),\nan institute of higher learning under the purview of the Ministry of Education in Singapore. Under this agreement, Cuprina and RP collaborated\nto generate bullfrog collagen peptides that can be sold as is or separated and sold as individual peptide fragments.\n\n \n\nSince\nthe completion of this consultancy proposal in February 2025, Cuprina has identified a method to generate a series of these peptides\nthat can potentially be used for cosmeceutical applications including skin moisturization, collagen remodeling, and other commercial\napplications. Cuprina is currently in the process of pursuing marketing opportunities for these peptides with a number of cosmeceutical\nentities.\n\n \n\nCuprina’s\nsecond study, a research collaboration agreement (“RCA”) which commenced in October 2024, was signed with the Institute for\nHealth Innovation and Technology at the National University of Singapore, Singapore’s flagship university that offers a global\napproach to education, research and entrepreneurship. Joint research from this agreement is aimed at exploring the viability of using\nbullfrog collagen peptides in the production of 3D printable wound care dressings for a variety of research and clinical applications.\nFunding for this research is supported by the National Additive Manufacturing Innovation Cluster Singapore, a national platform hosted\nby the Agency for Science, Technology and Research.\n\n \n\nCurrently,\nCuprina is performing testing aimed at measuring the effect of integrating bullfrog collagen into the structure of microneedling patches,\nwhich contain tiny needles that allow active ingredients to penetrate deeper into the skin and enhance wound healing. If these tests\nprove successful, these new patches could help to control the inflammation that typically impedes wound healing.\n\n \n\n\n\n\n",
    "Archives_edgar_data_1995704_000164117225013537_form6-k.htm": "\n\n     \n\n\n\n \n\n\n\n \n\n\n\n \n\nUNITED\nSTATES\n\nSECURITIES\nAND EXCHANGE COMMISSION\n\nWashington,\nD.C. 20549\n\n \n\nFORM\n6-K\n\n \n\nREPORT\nOF FOREIGN PRIVATE ISSUER\nPURSUANT TO RULE 13a-16 OR 15d-16\nUNDER THE SECURITIES EXCHANGE ACT OF 1934\n\n \n\nFor\nthe month of June 2025\n\n \n\nCommission\nFile Number: 001-42288\n\n \n\nCuprina\nHoldings (Cayman) Limited\n\n(Registrant’s\nName)\n\n \n\nc/o\nBlk 1090 Lower Delta Road #06-08\n\nSingapore\n169201\n\n(Address\nof Principal Executive Offices)\n\n \n\nIndicate\nby check mark whether the registrant files or will file annual reports under cover Form 20-F or Form 40-F.\n\n \n\n\n  \n    Form\n20-F ☒\n     \n    Form\n40-F ☐\n  \n \n\nIndicate\nby check mark if the registrant is submitting the Form 6-K in paper as permitted by Regulation S-T Rule 101(b)(1): ☐\n\n \n\nIndicate\nby check mark if the registrant is submitting the Form 6-K in paper as permitted by Regulation S-T Rule 101(b)(7): ☐\n\n \n\n\n\n \n\n\n\n ",
    "Archives_edgar_data_1995704_000164117225013537_ex99-1.htm": "\n\n     \n\n\n\n \n\nExhibit\n99.1\n\n \n\n\n\n \n\nCuprina\nCompletes Lab Able to Supply MEDIFLY Chronic Wound Therapy Across MENA\n\nRegion,\nSecures Exclusive License to Market Medicinal Leeches in GCC Countries\n\n \n\nSINGAPORE,\nJune 4, 2025 – Cuprina Holdings (Cayman) Limited (Nasdaq: CUPR) (“CUPR” or “the Company”),\na biomedical and biotechnology company dedicated to the development and commercialization of products for the management of chronic wounds\nand infertility, as well as cosmeceuticals for the health and beauty sector, today announced that its indirect 49%-owned associate, Cuprina\nMENA Co. Ltd, had completed the set-up of a laboratory, located in Saudi Arabia, equipped to manufacture the company’s MEDIFLY\nmaggot debridement therapy for the treatment of chronic wounds and to supply the therapy across the Middle East and North Africa (“MENA”)\nregion.\n\n \n\nCuprina\nMENA is now working towards obtaining the regulatory approvals, including the Saudi Food and Drug Authority license and ISO 13485 certification,\nrequired in order to sell the therapy in the MENA region.\n\n \n\nIn\nanother development, Cuprina MENA has secured exclusive rights from Biopharm UK Ltd (“BioPharm”), the world’s leading\nprovider of medicinal leeches, to sell these leeches across the Gulf Cooperation Council (“GCC”) countries.\n\n \n\nMedicinal\nleeches are increasingly used in the GCC to treat diverse medical conditions including venous congestion, which is a buildup of blood\nin the veins, and to aid in tissue healing and circulation following reconstructive and microsurgery procedures. The leeches are also\nused to relieve symptoms of osteoarthritis as well as in veterinary surgery, especially to help treat polycythaemia vera, a chronic blood\ncancer.\n\n \n\n“We\nare excited to complete both of these milestones,” said Cuprina chief executive David Quek. “These achievements, we believe,\nwill help us to expand our market reach in the MENA and GCC regions, and add significant incremental revenue for our company.\n\n \n\n“I\nlook forward to sharing updates on these developments in the near future.”\n\n \n\n",
    "Archives_edgar_data_1995704_000164117225010302_ex11-2.htm": "\n\n     \n\n\n\n \n\nExhibit\n11.2\n\n \n\nInsider\nTrading Policy \n\n \n\nof\n\n\n \n\nCuprina\nHoldings (Cayman) Limited\n\n \n\n\n1.Purpose\n\n \n\nThis\nInsider Trading Policy (the “Policy”) provides guidelines with respect to transactions in the securities of\nCuprina Holdings (Cayman) Limited (the “Company”) and the handling of confidential information about the Company\nand the companies with which the Company does business. The Company’s Board of Directors has adopted this Policy to promote compliance\nwith United States federal, state, and foreign securities laws that prohibit certain persons who are aware of material non-public information\nabout a company from: (i) trading in securities of that company; or (ii) providing material non-public information to other persons who\nmay trade on the basis of that information.\n\n \n\n\n2.Persons\n                                            Subject to the Policy\n\n \n\nThis\nPolicy applies to all officers of the Company and its subsidiaries, all members of the Company’s board of directors and all employees\nof the Company and its subsidiaries. The Company may also determine that other persons should be subject to this Policy, such as contractors\nor consultants who have access to material non-public information. This Policy also applies to family members, other members of a person’s\nhousehold and entities controlled by a person covered by this Policy, as described below.\n\n \n\n\n3.Transactions\n                                            Subject to the Policy\n\n \n\nThis\nPolicy applies to transactions in the Company’s securities (collectively referred to in this Policy as “Company Securities”),\nincluding the Company’s common stock, options to purchase common stock, or any other type of securities that the Company may issue,\nincluding (but not limited to) preferred stock, convertible debentures, and warrants, as well as derivative securities that are not issued\nby the Company, such as exchange-traded put or call options or swaps relating to the Company’s Securities.\n\n \n\n\n4.Individual\n                                            Responsibility\n\n \n\nPersons\nsubject to this Policy have ethical and legal obligations to maintain the confidentiality of information about the Company and to not\nengage in transactions in Company Securities while in possession of material non-public information. Each individual is responsible for\nmaking sure that he or she complies with this Policy, and that any family member, household member or entity whose transactions are subject\nto this Policy, as discussed below, also comply with this Policy. In all cases, the responsibility for determining whether an individual\nis in possession of material non-public information rests with that individual, and any action on the part of the Company, the Compliance\nOfficer or any other employee or director pursuant to this Policy (or otherwise) does not in any way constitute legal advice or insulate\nan individual from liability under applicable securities laws. You could be subject to severe legal penalties and disciplinary action\nby the Company for any conduct prohibited by this Policy or applicable securities laws, as described below in more detail under the heading\n“Consequences of Violations.”\n\n \n\n",
    "Archives_edgar_data_1995704_000164117225010302_ex12-1.htm": "\n\n     \n\n\n\n \n\nExhibit\n12.1\n\n \n\nCertification\nby the Principal Executive Officer\n\n \n\nPursuant\nto Section 302 of the Sarbanes-Oxley Act of 2002\n\n \n\n\n  \n    I,\n    David\n    Quek Yong Qi, certify that:\n  \n \n\n\n  \n    1.\n    I\n    have reviewed this Form-20-F of Cuprina Holdings (Cayman) Limited;\n  \n \n\n\n  \n    2.\n    Based\n    on my knowledge, this report does not contain any untrue statement of a material fact or omit to state a material fact necessary\n    to make the statements made, in light of the circumstances under which such statements were made, not misleading with respect to\n    the period covered by this report;\n  \n \n\n\n  \n    3.\n    Based\n    on my knowledge, the financial statements, and other financial information included in this report, fairly present in all material\n    respects the financial condition, results of operations and cash flows of the company as of, and for, the periods presented in this\n    report;\n  \n \n\n\n  \n    4.\n    The\n    company’s other certifying officer and I are responsible for establishing and maintaining disclosure controls and procedures\n    (as defined in Exchange Act Rules 13a-15(e) and 15d-15(e)) and internal control over financial reporting (as defined in Exchange\n    Act Rules 13a-15(f) and 15d-15(f)) for the company and have:\n  \n \n\n\n  \n     \n    (a)\n    Designed\n    such disclosure controls and procedures, or caused such disclosure controls and procedures to be designed under our supervision,\n    to ensure that material information relating to the company, including its consolidated subsidiaries, is made known to us by others\n    within those entities, particularly during the period in which this report is being prepared;\n  \n \n\n\n  \n     \n    (b)\n    (Paragraph\n    omitted pursuant to SEC Release Nos. 33-8238/34-47986 and 33-8392/34-49313);\n  \n \n\n\n  \n     \n    (c)\n    Evaluated\n    the effectiveness of the company’s disclosure controls and procedures and presented in this report our conclusions about the\n    effectiveness of the disclosure controls and procedures, as of the end of the period covered by this report based on such evaluation;\n    and\n  \n \n\n\n  \n     \n    (d)\n    Disclosed\n    in this report any change in the company’s internal control over financial reporting that occurred during the period covered\n    by the annual report that has materially affected, or is reasonably likely to materially affect, the company’s internal control\n    over financial reporting; and\n  \n \n\n\n  \n    5.\n    The\n    company’s other certifying officer and I have disclosed, based on our most recent evaluation of internal control over financial\n    reporting, to the company’s auditors and the audit committee of the company’s board of directors (or persons performing\n    the equivalent functions):\n  \n \n\n\n  \n     \n    (a)\n    All\n    significant deficiencies and material weaknesses in the design or operation of internal control over financial reporting which are\n    reasonably likely to adversely affect the company’s ability to record, process, summarize and report financial information;\n    and\n  \n \n\n\n  \n     \n    (b)\n    Any\n    fraud, whether or not material, that involves management or other employees who have a significant role in the company’s internal\n    control over financial reporting.\n  \n \n\nDate:\nMay 14, 2025\n\n \n\n\n  \n    By:\n    /s/\n    David Quek Yong Qi\n     \n  \n    Name:\n    \n    David\n    Quek Yong Qi\n     \n  \n    Title:\n    Chief\n    Executive Officer\n     \n  \n \n\n\n\n     \n    \n\n \n\n\n\n",
    "Archives_edgar_data_1995704_000164117225010302_ex12-2.htm": "\n\n     \n\n\n\n \n\nExhibit\n12.2\n\n \n\nCertification\nby the Principal Financial Officer\n\n \n\nPursuant\nto Section 302 of the Sarbanes-Oxley Act of 2002\n\n \n\n\n  \n    I,\n    Chan\n    Tat Jing, certify that:\n  \n \n\n\n  \n    1.\n    I\n    have reviewed this Form-20-F of Cuprina Holdings (Cayman) Limited;\n  \n \n\n\n  \n    2.\n    Based\n    on my knowledge, this report does not contain any untrue statement of a material fact or omit to state a material fact necessary\n    to make the statements made, in light of the circumstances under which such statements were made, not misleading with respect to\n    the period covered by this report;\n  \n \n\n\n  \n    3.\n    Based\n    on my knowledge, the financial statements, and other financial information included in this report, fairly present in all material\n    respects the financial condition, results of operations and cash flows of the company as of, and for, the periods presented in this\n    report;\n  \n \n\n\n  \n    4.\n    The\n    company’s other certifying officer and I are responsible for establishing and maintaining disclosure controls and procedures\n    (as defined in Exchange Act Rules 13a-15(e) and 15d-15(e)) and internal control over financial reporting (as defined in Exchange\n    Act Rules 13a-15(f) and 15d-15(f)) for the company and have:\n  \n \n\n\n  \n     \n    (a)\n    Designed\n    such disclosure controls and procedures, or caused such disclosure controls and procedures to be designed under our supervision,\n    to ensure that material information relating to the company, including its consolidated subsidiaries, is made known to us by others\n    within those entities, particularly during the period in which this report is being prepared;\n  \n \n\n\n  \n     \n    (b)\n    (Paragraph\n    omitted pursuant to SEC Release Nos. 33-8238/34-47986 and 33-8392/34-49313);\n  \n \n\n\n  \n     \n    (c)\n    Evaluated\n    the effectiveness of the company’s disclosure controls and procedures and presented in this report our conclusions about the\n    effectiveness of the disclosure controls and procedures, as of the end of the period covered by this report based on such evaluation;\n    and\n  \n \n\n\n  \n     \n    (d)\n    Disclosed\n    in this report any change in the company’s internal control over financial reporting that occurred during the period covered\n    by the annual report that has materially affected, or is reasonably likely to materially affect, the company’s internal control\n    over financial reporting; and\n  \n \n\n\n  \n    5.\n    The\n    company’s other certifying officer and I have disclosed, based on our most recent evaluation of internal control over financial\n    reporting, to the company’s auditors and the audit committee of the company’s board of directors (or persons performing\n    the equivalent functions):\n  \n \n\n\n  \n     \n    (a)\n    All\n    significant deficiencies and material weaknesses in the design or operation of internal control over financial reporting which are\n    reasonably likely to adversely affect the company’s ability to record, process, summarize and report financial information;\n    and\n  \n \n\n\n  \n     \n    (b)\n    Any\n    fraud, whether or not material, that involves management or other employees who have a significant role in the company’s internal\n    control over financial reporting.\n  \n \n\n\n  \n    Date:\n    May 14, 2025\n     \n  \n     \n     \n     \n  \n    By:\n    /s/\n    Chan Tat Jing\n     \n  \n    Name:\n    \n    Chan\n    Tat Jing\n     \n  \n    Title:\n    Chief\n    Financial Officer\n     \n  \n \n\n\n\n     \n    \n\n \n\n\n\n",
    "Archives_edgar_data_1995704_000164117225010302_ex13-1.htm": "\n\n     \n\n\n\n \n\nExhibit\n13.1\n\n \n\nCertification\nby the Principal Executive Officer\n\n \n\nPursuant\nto Section 906 of the Sarbanes-Oxley Act of 2002\n\n \n\nIn\nconnection with the Form-20-F of Cuprina Holdings (Cayman) Limited (the “Company”) for the fiscal year ended December 31,\n2024 as filed with the Securities and Exchange Commission on the date hereof (the “Report”), I, David Quek Yong Qi, Chief\nExecutive Officer of the Company, certify, pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley\nAct of 2002, that to my knowledge:\n\n \n\n\n  \n    (1)\n    The\n    Report fully complies with the requirements of Section 13(a) or 15(d) of the Securities Exchange Act of 1934; and\n  \n \n\n\n  \n    (2)\n    The\n    information contained in the Report fairly presents, in all material respects, the financial condition and results of operations\n    of the Company.\n  \n \n\nDate:\nMay 14, 2025\n\n \n\n\n  \n    By:\n    /s/\n    David Quek Yong Qi\n     \n  \n    Name:\n    \n    David\n    Quek Yong Qi\n     \n  \n    Title:\n    Chief\n    Executive Officer\n     \n  \n \n\n\n\n     \n    \n\n \n\n\n\n",
    "Archives_edgar_data_1995704_000164117225010302_ex13-2.htm": "\n\n     \n\n\n\n \n\nExhibit\n13.2\n\n \n\nCertification\nby the Principal Financial Officer\n\n \n\nPursuant\nto Section 906 of the Sarbanes-Oxley Act of 2002\n\n \n\nIn\nconnection with the Form-20-F of Cuprina Holdings (Cayman) Limited (the “Company”) for the fiscal year ended December 31,\n2024 as filed with the Securities and Exchange Commission on the date hereof (the “Report”), I, Chan Tat Jing, Chief Financial\nOfficer of the Company, certify, pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of\n2002, that to my knowledge:\n\n \n\n\n  \n    (1)\n    The\n    Report fully complies with the requirements of Section 13(a) or 15(d) of the Securities Exchange Act of 1934; and\n  \n \n\n\n  \n    (2)\n    The\n    information contained in the Report fairly presents, in all material respects, the financial condition and results of operations\n    of the Company.\n  \n \n\nDate:\nMay 14, 2025\n\n \n\n\n  \n    By:\n    /s/\n    Chan Tat Jing\n     \n  \n    Name:\n    \n    Chan\n    Tat Jing\n     \n  \n    Title:\n    Chief\n    Financial Officer\n     \n  \n \n\n\n\n     \n    \n\n \n\n \n\n\n\n",
    "Archives_edgar_data_1995704_000164117225009201_form6-k.htm": "\n\n     \n\n\n\n \n\n\n\n \n\n \n\nUNITED\nSTATES\n\nSECURITIES\nAND EXCHANGE COMMISSION\n\nWashington,\nD.C. 20549\n\n \n\nFORM\n6-K\n\n \n\nREPORT\nOF FOREIGN PRIVATE ISSUER\n\nPURSUANT TO RULE 13a-16 OR 15d-16\n\nUNDER THE SECURITIES EXCHANGE ACT OF 1934\n\n \n\nFor\nthe month of May 2025\n\n \n\nCommission\nFile Number: 001-42288\n\n \n\nCuprina\nHoldings (Cayman) Limited\n\n(Registrant’s\nName)\n\n \n\nc/o\nBlk 1090 Lower Delta Road #06-08\n\nSingapore\n169201\n\n(Address\nof Principal Executive Offices)\n\n \n\nIndicate\nby check mark whether the registrant files or will file annual reports under cover Form 20-F or Form 40-F.\n\n \n\n\n  \n    Form\n    20-F ☒\n     \n    Form\n    40-F ☐\n  \n \n\nIndicate\nby check mark if the registrant is submitting the Form 6-K in paper as permitted by Regulation S-T Rule 101(b)(1): ☐\n\n \n\nIndicate\nby check mark if the registrant is submitting the Form 6-K in paper as permitted by Regulation S-T Rule 101(b)(7): ☐\n\n \n\n\n\n \n\n \n\n",
    "Archives_edgar_data_1995704_000164117225009201_ex99-1.htm": "\n\n     \n\n\n\n \n\nExhibit 99.1\n\n \n\n\n\n \n\nCuprina\nHoldings Announces Closing of Underwriter’s\nOver-Allotment Option in Connection with Initial Public Offering\n\n \n\nSINGAPORE,\nMay 8, 2025 – Cuprina Holdings (Cayman) Limited (Nasdaq: CUPR) (“Cuprina” or “the Company”),\na biomedical and biotechnology company dedicated to the development and commercialization of products for the management of chronic wounds\nand infertility, as well as cosmeceuticals for the health and beauty sector, today announced that\nit closed the sale of an additional 450,000 Class A ordinary shares of the Company, pursuant to the full exercise of the underwriter’s\nover-allotment option granted in connection with the Company’s initial public offering (“IPO”, together with\nsuch over-allotment closing, the “Offering”), at the IPO price of $4.00 per share, less underwriting discounts. As\na result, the Company has raised aggregate gross proceeds of $13,800,000, including the previously announced IPO gross proceeds of $12,000,000,\nprior to deducting underwriting discounts and commissions and estimated offering expenses payable by the Company.\n\n \n\nR.\nF. Lafferty & Co., Inc. (“R. F. Lafferty ” ), acted as the sole book-running manager for the Offering. Loeb &\nLoeb LLP, Lee & Lee, Harney Westwood & Riegels Singapore LLP are acting as U.S., Singapore and Cayman Islands legal counsels\nto the Company, respectively, and Winston & Strawn LLP is acting as U.S. legal counsel to R. F. Lafferty for the Offering.\n\n \n\nThe\nOffering is being conducted pursuant to the Company’s registration statement on Form F-1 (File No. 333-283643), as amended, previously\nfiled with and subsequently declared effective by the U.S. Securities and Exchange Commission (“SEC”) on March 31,\n2025. The Offering is being made only by means of a prospectus, forming part of the registration statement. Copies of the final prospectus\nrelated to the Offering may be obtained, when available, from R. F. Lafferty & Co., Inc., 40 Wall Street, 27th Floor, New York, NY\n10005; (212) 293-9090, or by email at offerings@rflafferty.com. In addition, a copy of the final prospectus, when available, relating\nto the Offering may be obtained via the SEC’s website at www.sec.gov .\n\n \n\nBefore\nyou invest, you should read the prospectus and other documents the Company has filed or will file with the SEC for more information about\nthe Company and the Offering. This press release has been prepared for informational purposes only and shall not constitute an offer\nto sell or the solicitation of an offer to buy these securities, nor shall such securities be offered or sold in the United States absent\nregistration or an applicable exemption from registration, nor shall there be any offer, solicitation or sale of these securities in\nany state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the\nsecurities laws of any such state or jurisdiction.\n\n \n\n",
    "Archives_edgar_data_1995704_000164117225009170_form6-k.htm": "\n\n     \n\n\n\n \n\n\n\n \n\n \n\n\n\nUNITED\nSTATES\n\nSECURITIES\nAND EXCHANGE COMMISSION\n\nWashington,\nD.C. 20549\n\n \n\nFORM\n6-K\n\n \n\nREPORT\nOF FOREIGN PRIVATE ISSUER\n\nPURSUANT\nTO RULE 13a-16 OR 15d-16\n\nUNDER\nTHE SECURITIES EXCHANGE ACT OF 1934\n\n \n\nFor\nthe month of May 2025\n\n \n\nCommission\nFile Number: 001-42288\n\n \n\nCuprina\nHoldings (Cayman) Limited\n\n(Registrant’s\nName)\n\n \n\nc/o\nBlk 1090 Lower Delta Road #06-08\n\nSingapore\n169201\n\n(Address\nof Principal Executive Offices)\n\n \n\nIndicate\nby check mark whether the registrant files or will file annual reports under cover Form 20-F or Form 40-F.\n\n \n\n\n  \n    Form\n    20-F ☒\n     \n    Form\n    40-F ☐\n  \n \n\nIndicate\nby check mark if the registrant is submitting the Form 6-K in paper as permitted by Regulation S-T Rule 101(b)(1): ☐\n\n \n\nIndicate\nby check mark if the registrant is submitting the Form 6-K in paper as permitted by Regulation S-T Rule 101(b)(7): ☐\n\n \n\n\n\n \n\n \n\n",
    "Archives_edgar_data_1995704_000164117225008637_form6-k.htm": "\n\n     \n\n\n\n \n\n\n\n \n\n \n\nUNITED\nSTATES\n\nSECURITIES\nAND EXCHANGE COMMISSION\n\nWashington,\nD.C. 20549\n\n \n\nFORM\n6-K\n\n \n\nREPORT\nOF FOREIGN PRIVATE ISSUER\nPURSUANT TO RULE 13a-16 OR 15d-16\nUNDER THE SECURITIES EXCHANGE ACT OF 1934\n\n \n\nFor\nthe month of May 2025\n\n \n\nCommission\nFile Number: 001-42288\n\n \n\nCuprina\nHoldings (Cayman) Limited\n\n(Registrant’s\nName)\n\n \n\nc/o\nBlk 1090 Lower Delta Road #06-08\n\nSingapore\n169201 \n\n(Address\nof Principal Executive Offices)\n\n \n\nIndicate\nby check mark whether the registrant files or will file annual reports under cover Form 20-F or Form 40-F.\n\n \n\n\n\n  Form 20-F\n  ☒\n     \n  Form 40-F ☐\n\n\n\n \n\nIndicate\nby check mark if the registrant is submitting the Form 6-K in paper as permitted by Regulation S-T Rule 101(b)(1): ☐\n\n \n\nIndicate\nby check mark if the registrant is submitting the Form 6-K in paper as permitted by Regulation S-T Rule 101(b)(7): ☐\n\n \n\n\n\n \n\n ",
    "Archives_edgar_data_1995704_000164117225008637_ex99-1.htm": "\n\n     \n\n\n\n \n\nExhibit\n99.1\n\n \n\n\n\n \n\nCuprina\nHoldings Announces Completion, Receipt of Certification and License,\n\nfor\nIVF Media Production Facility Built in Collaboration with Ferti-Craft Pte Ltd.\n\n \n\nSINGAPORE,\nMay 5, 2025 – Cuprina Holdings (Cayman) Limited (Nasdaq: CUPR) (“Cuprina” or “the Company”),\na biomedical and biotechnology company dedicated to the development and commercialization of products for the management of chronic wounds\nand infertility, as well as cosmeceuticals for the health and beauty sector, today announced it had, on April 6, 2025, completed construction\nof , and obtained ISO 13485 certification  and a dealer license  for, an operational in-vitro fertilization (“IVF”)\nmedia production facility in Singapore.\n\n \n\nThe\nISO 13485 certification, which validates that Cuprina’s quality management system at the facility meets internationally agreed\nstandards for medical device manufacturing, was issued by United Kingdom Accreditation Service (“UKAS”), a part of the International\nAccreditation Forum (“IAF”). The dealer license, which confers legal authorization\nto businesses operating in specific activities including manufacturing, importing, or wholesaling medical devices, was issued\nby the Singapore Health Sciences Authority (HSA).\n\n \n\nBuilt\nas part of an Agreement with Ferti-Craft Pte Ltd.(“Ferti-Craft”), a Singapore-based medtech company, the facility\nis intended to produce 14 SKUs of the IVF media product containing the nutrients, electrolytes, amino acids, and other materials required\nto stimulate fertilization of sperm and ovum in-vitro (in the lab).\n\n \n\nCuprina\nwill collaborate with Ferti-Craft to prepare and submit the required regulatory dossiers for registration with Singapore Health Sciences\nAuthority (“HSA”). The goal is to obtain approval for 14 IVF media product SKUs. The project aims to secure HSA approval\nfor commercial sale before the fourth quarter of 2026.\n\n \n\nFerti-Craft\nwill be responsible for obtaining all necessary documentation and testing certificates required by HSA, arranging the selection and logistics\nof all raw materials required for the production of these SKUs, and contributing the intellectual property, subject matter expertise\non human assisted reproductive technology (“ART”), and production know-how on the preparation of these SKUs.\n\n \n\nSubject\nto obtaining the necessary regulatory approvals, the facility is expected to commence producing commercialized product by the fourth\nquarter of 2026. Ferti-Craft expects initial sales to be primarily in Singapore, with an expanded presence to follow in select ASEAN\ncountries, the Middle East and other global markets.\n\n ",
    "Archives_edgar_data_1995704_000164117225005153_formnt20-f.htm": "\n\n     \n\n\n\n \n\n\n\n \n\n\n\n \n\nUNITED\nSTATES\n\nSECURITIES\nAND EXCHANGE COMMISSION\n\nWASHINGTON,\nDC 20549\n\n \n\nFORM\n12b-25\n\n \n\nNOTIFICATION\nOF LATE FILING\n\n \n\n\n  \n    (Check\n    one): \n     \n    ☐\n    Form 10-K ☒ Form 20-F ☐ Form 11-K ☐ Form 10-Q ☐ Form 10-D ☐ Form N-CEN ☐ Form N-CSR\n  \n     \n     \n  \n     \n     \n    For\n    Period Ended: December 31, 2024\n  \n     \n     \n  \n     \n     \n    ☐\n    Transition Report on Form 10-K\n  \n     \n     \n  \n     \n     \n    ☐\n    Transition Report on Form 20-F\n  \n     \n     \n  \n     \n     \n    ☐\n    Transition Report on Form 11-K\n  \n     \n     \n  \n     \n     \n    ☐\n    Transition Report on Form 10-Q\n  \n     \n     \n  \n     \n     \n    For\n    the Transition Period Ended: _________________\n  \n \n\n\n  \n    Nothing in this form shall be construed to imply that the Commission has verified any information\n                                                                                contained herein.\n  \n \n\nIf\nthe notification relates to a portion of the filing checked above, identify the Item(s) to which the notification relates:\n\n \n\nPART\nI - REGISTRANT INFORMATION\n\n \n\nCuprina\nHoldings (Cayman) Limited\n\nFull\nName of Registrant\n\nN/A\n\nFormer\nName if Applicable\n\n \n\nc/o\nBlk 1090 Lower Delta Road #06-08\nSingapore, 169201\nAddress of Principal Executive Office (Street and Number)\n\n \n\nSingapore,\n169201\n\nCity,\nState and Zip Code\n\n \n\n\n\n \n\n\n\n ",
    "Archives_edgar_data_1995704_000164117225003758_form6-k.htm": "\n\n     \n\n\n\n \n\n\n\n \n\n \n\nUNITED STATES\n\nSECURITIES AND EXCHANGE\nCOMMISSION\n\nWashington, D.C.\n20549\n\n \n\nFORM 6-K\n\n \n\nREPORT OF FOREIGN PRIVATE ISSUER\nPURSUANT TO RULE 13a-16 OR 15d-16\nUNDER THE SECURITIES EXCHANGE ACT OF 1934\n\n \n\nFor the month of April 2025\n\n \n\nCommission File Number: 001-42288\n\n \n\nCuprina Holdings\n(Cayman) Limited \n\n(Registrant’s Name)\n\n \n\nc/o Blk 1090 Lower Delta Road #06-08\n\nSingapore 169201 \n\n(Address of Principal Executive Offices)\n\n \n\nIndicate by check mark whether the registrant files or will file annual\nreports under cover Form 20-F or Form 40-F.\n\n \n\nForm 20-F ☒            Form\n40-F ☐\n\n \n\nIndicate by check mark if the registrant is submitting the Form 6-K in\npaper as permitted by Regulation S-T Rule 101(b)(1): ☐\n\n \n\nIndicate by check mark if the registrant is submitting the Form 6-K in\npaper as permitted by Regulation S-T Rule 101(b)(7): ☐\n\n \n\n\n\n \n\n ",
    "Archives_edgar_data_1995704_000164117225003758_ex4-1.htm": "\n\n     \n\n\n\n \n\nExhibit 4.1\n\n \n\nForm of Representative’s Warrant\n\n \n\nTHE REGISTERED\nHOLDER OF THIS PURCHASE WARRANT AGREES BY HIS, HER OR ITS ACCEPTANCE HEREOF, THAT SUCH HOLDER WILL NOT FOR A PERIOD OF ONE HUNDRED EIGHTY\n(180) DAYS BEGINNING ON THE date of the commencemEnt of sales of the offering pursuant the registration statement No: 333-283643\nAS FILED WITH THE SECURITIES AND EXCHANGE COMMISSION: (A) SELL, TRANSFER, ASSIGN, PLEDGE OR HYPOTHECATE\nTHIS PURCHASE WARRANT TO ANYONE OTHER THAN OFFICERS OR PARTNERS OF R. F. Lafferty & Co., Inc., EACH OF WHOM SHALL HAVE AGREED TO THE\nRESTRICTIONS CONTAINED HEREIN, IN ACCORDANCE WITH FINRA CONDUCT RULE 5110(E)(1), OR (B) CAUSE THIS PURCHASE WARRANT OR THE SECURITIES\nISSUABLE HEREUNDER TO BE THE SUBJECT OF ANY HEDGING, SHORT SALE, DERIVATIVE, PUT OR CALL TRANSACTION THAT WOULD RESULT IN THE EFFECTIVE\nECONOMIC DISPOSITION OF THIS PURCHASE WARRANT OR THE SECURITIES HEREUNDER, EXCEPT AS PROVIDED FOR IN FINRA RULE 5110(e)(2).\n\n \n\nClass A Ordinary\nShares Purchase Warrant\n\n \n\nCUPRINA HOLDINGS (CAYMAN) LIMITED\n\n \n\n\n  \n    Warrant Shares: 150,000\n    Initial Exercise Date: _____, 20__\n  \n     \n    Issue Date: April 11, 2025\n  \n \n\nTHIS CLASS A ORDINARY SHARES\nPURCHASE WARRANT (the “Warrant”) certifies that, for value received, R. F. Lafferty & Co., Inc. or its assigns\n(the “Holder”) are entitled, upon the terms and subject to the limitations on exercise and the conditions hereinafter\nset forth, at any time on or after October 7, 2025, the date that is 180 days after the commencement of sales under the Registration Statement\n(the “Initial Exercise Date”) and on or prior to 5:00 p.m. (Eastern Time) on April 10, 2030, the date that is\nfive (5) years after the commencement of sales under the Registration Statement (the “Termination Date”) but\nnot thereafter, in compliance with FINRA Rule 5110(e)(1) and FINRA Rule 5110(g)(8)(A), to subscribe for and purchase from Cuprina Holdings\n(Cayman) Limited , a Cayman Islands exempted company with limited liability (the “Company”), up to 150,000 Class\nA Ordinary Shares (as defined below) (as subject to adjustment hereunder, the “Warrant Shares”). The Warrant\nand the underlying Warrant Shares must not be sold, transferred, assigned, pledged, or hypothecated, or be the subject of any hedging,\nshort sale, derivative, put, or call transaction that would result in the effective economic disposition of the securities for a period\nof 180 days beginning on the date of the commencement of sales of the public offering under the Registration Statement, except as provided\nin FINRA Rule 5110 (e)(2).The purchase price of one Class A Ordinary Shares under this Warrant shall be equal to the Exercise Price, as\ndefined in Section 2(b).\n\n \n\nSection 1. Definitions.\nIn addition to the terms defined elsewhere in this Warrant, the following terms have the meanings indicated in this Section 1:\n\n \n\n“Affiliate”\nmeans any Person that, directly or indirectly through one or more intermediaries, controls or is controlled by or is under common\ncontrol with a Person, as such terms are used in and construed under Rule 405 under the Securities Act.\n\n \n\n“Bid Price”\nmeans, for any date, the price determined by the first of the following clauses that applies: (a) if the Class A Ordinary Shares are then\nlisted or quoted on a Trading Market, the bid price of the Class A Ordinary Share for the time in question (or the nearest preceding date)\non the Trading Market on which the Class A Ordinary Shares are then listed or quoted as reported by Bloomberg L.P. (based on a Trading\nDay from 9:30 a.m. (Eastern Time) to 4:02 p.m. (Eastern Time)), (b) if OTCQB or OTCQX is not a Trading Market, the volume weighted average\nprice of the Class A Ordinary Share for such date (or the nearest preceding date) on OTCQB or OTCQX as applicable, (c) if the Class A\nOrdinary Shares are not then listed or quoted for trading on OTCQB or OTCQX and if prices for the Class A Ordinary Shares are then reported\non the Pink Open Market (or a similar organization or agency succeeding to its functions of reporting prices), the most recent bid price\nper Class A Ordinary Share so reported, or (d) in all other cases, the fair market value of a share of Class A Ordinary Share as determined\nby an independent appraiser selected in good faith by the Holders of a majority in interest of the Warrants then outstanding and reasonably\nacceptable to the Company, the fees and expenses of which shall be paid by the Company.\n\n ",
    "Archives_edgar_data_1995704_000164117225003758_ex10-1.htm": "\n\n     \n\n\n\n \n\nExhibit 10.1\n\n \n\nEXECUTION VERSION\n\n \n\nCUPRINA HOLDINGS (CAYMAN) LIMITED\n\n \n\nUNDERWRITING AGREEMENT\n\n \n\nApril 9, 2025\n\n \n\nR. F. Lafferty & Co., Inc.\n\n40 Wall Street, 27th Floor\n\nNew York, NY 10005\n\n \n\nAs Representative of the Underwriters\n\nnamed on Schedule A hereto\n\n \n\nLadies and Gentlemen:\n\n \n\nThe undersigned, Cuprina Holdings\n(Cayman) Limited, a Cayman Islands exempted company, (the “Company”), hereby confirms its agreement (this “Agreement”)\nwith the several underwriters named in Schedule A hereto (such underwriters including Representative (as defined below), collectively,\nhereafter referred to as the “Underwriters”, and each of them as an “Underwriter”), for which R.\nF. Lafferty & Co., Inc. acting as the representative of the several Underwriters (in such capacity, the “Representative”),\nto issue and sell an aggregate of 3,000,000 Class A ordinary shares (the “Firm Shares”) of the Company of par value of $0.001\nper share (the “Class A Ordinary Shares”).\n\n \n\nThe Company has also granted to\nthe Underwriters an option to purchase up to 450,000 additional Class A Ordinary Shares, exercisable by the Representative, on the terms\nand conditions for the purposes set forth in Section 2(c) hereof (the “Additional Shares”). The Firm Shares\nand any Additional Shares purchased pursuant to this Agreement are herein collectively referred to as the “Offered Securities.”\nThe offering and sale of the Offered Securities contemplated by this Agreement is referred to herein as the “Offering.”\n\n \n\nThe Company confirms its agreement\nwith the Underwriters as follows:\n\n \n\nSection 1. Representations\nand Warranties of the Company.\n\n \n\nThe Company represents and warrants\nto each of the Underwriters as follows with the understanding that the same may be relied upon by the Underwriters in the Offering, as\nof the date hereof and as of the Closing Date (as defined below) and each Option Closing Date (as defined below), if any:\n\n \n\n(a) Filing of the Registration\nStatement. The Company has prepared and filed with the Securities and Exchange Commission (the “Commission”) a\nregistration statement on Form F-1 (File No. 333-283643), and amendments thereto, which contains a form of prospectus to be used in connection\nwith the Offering. Such registration statement, as amended, including the financial statements, exhibits and schedules thereto contained\nin the registration statement at the time such registration statement became effective, in the form in which it was declared effective\nby the Commission under the Securities Act of 1933, as amended (the “Securities Act”), and the rules and regulations\npromulgated thereunder (the “Securities Act Regulations”), and including any required information deemed to be a part\nthereof at the time of effectiveness pursuant to Rule 430A under the Securities Act, or pursuant to the Securities Exchange Act of 1934,\nas amended (the “Exchange Act”) and the rules and regulations promulgated thereunder (the “Exchange Act Regulations”),\nis called the “Registration Statement.” Any registration statement filed by the Company pursuant to Rule 462(b) under\nthe Securities Act is called the “Rule 462(b) Registration Statement,” and from and after the date and time of filing\nof the Rule 462(b) Registration Statement, the term “Registration Statement” shall include the Rule 462(b) Registration\nStatement. Such prospectus, in the form first filed pursuant to Rule 424(b) under the Securities Act after the date and time that this\nAgreement is executed and delivered by the parties hereto, or, if no filing pursuant to Rule 424(b) under the Securities Act is required,\nthe form of final prospectus relating to the Offering included in the Registration Statement at the effective date of the Registration\nStatement (“Effective Date”), is called the “Prospectus.” All references in this Agreement to the\nRegistration Statement, the Rule 462(b) Registration Statement, the preliminary prospectus included in the Registration Statement (each,\na “preliminary prospectus”), the Prospectus, or any amendments or supplements to any of the foregoing, shall include\nany copy thereof filed with the Commission pursuant to its Electronic Data Gathering, Analysis and Retrieval System (“EDGAR”).\nThe preliminary prospectus that was included in the Registration Statement immediately prior to the Applicable Time (as defined below)\nis hereinafter called the “Pricing Prospectus.” Any reference to the “most recent preliminary prospectus”\nshall be deemed to refer to the latest preliminary prospectus included in the registration statement. Any reference herein to any preliminary\nprospectus or the Prospectus or any supplement or amendment to either thereof shall be deemed to refer to and include any documents incorporated\nby reference therein as of the date of such reference.\n\n ",
    "Archives_edgar_data_1995704_000164117225003758_ex99-1.htm": "\n\n     \n\n\n\n \n\nExhibit 99.1\n\n \n\n\n\n \n\nCuprina Holdings\n(Cayman) Limited Announces Pricing of $12 million Initial Public Offering\n\n \n\nSINGAPORE, April 10, 2025 – Cuprina Holdings\n(Cayman) Limited (“CUPR” or “the Company”), a biomedical and biotechnology company dedicated to\nthe development and commercialization of products for the management of chronic wounds as well as cosmeceuticals for the health and beauty\nsector, today announced the pricing of its firm commitment initial public offering of an aggregate 3,000,000 shares of its Class A Ordinary\nShares (“the Offering”), all of which are being offered by CUPR at a public offering price of $4.00 per share (“the\nOffering Price”).\n\n \n\nThe Company has granted the underwriter a 45-day option\nto purchase up to an additional 450,000 shares of its Class A Ordinary Shares at the Offering Price, representing 15% of the Class A Ordinary\nShares sold in the Offering (“the Over-allotment”).\n\n \n\nAssuming that the Over-allotment is exercised, the\nCompany is expected to receive gross proceeds amounting to $13.80 million, before deducting underwriting discounts and commissions and\nestimated offering expenses.\n\n \n\nThe shares are expected to begin trading on the NASDAQ\nStock Market LLC under the ticker symbol “CUPR” on April 10, 2025. The Offering is expected to close on April 11, 2025, subject\nto the satisfaction of customary closing conditions.\n\n \n\nR. F. Lafferty & Co., Inc. (“R. F. Lafferty”),\nacted as the sole book-running manager for the Offering. Loeb & Loeb LLP, Lee & Lee, Harney Westwood & Riegels Singapore LLP\nare acting as U.S., Singapore and Cayman Islands legal counsels to the Company, respectively, and Winston & Strawn LLP is acting as\nU.S. legal counsel to R. F. Lafferty for the Offering.\n\n \n\nThe Offering is being conducted pursuant to the Company’s\nRegistration Statement on Form F-1 (File No: 333-283643) previously filed with and subsequently declared effective by the U.S. Securities\nand Exchange Commission (“SEC”) on March 31, 2025. The Offering is being made only by means of a prospectus. Before\nyou invest, you should read the prospectus and other documents the Company has filed or will file with the SEC for more information about\nthe Company and the Offering. Copies of the final prospectus related to the Offering may be obtained, when available, from R. F. Lafferty\n& Co., Inc., 40 Wall Street, 27th Floor, New York, NY 10005; (212) 293-9090, or by email at offerings@rflafferty.com. In addition,\na copy of the final prospectus, when available, relating to the Offering may be obtained via the SEC’s website at www.sec.gov.\n\n ",
    "Archives_edgar_data_1995704_000164117225003758_ex99-2.htm": "\n\n     \n\n\n\n \n\nExhibit 99.2\n\n \n\n\n\n \n\nCuprina Holdings (Cayman) Limited Announces Closing\nof Initial Public Offering\n\n \n\nSINGAPORE, April 11, 2025\n– Cuprina Holdings (Cayman) Limited (Nasdaq: CUPR) (“CUPR” or “the Company”), a biomedical\nand biotechnology company dedicated to the development and commercialization of products for the management of chronic wounds as well\nas cosmeceuticals for the health and beauty sector, today announced the closing of its previously\nannounced initial public offering of an aggregate 3,000,000 Class A Ordinary Shares (“the Offering”) at a price\nof $4.00 per share (“the Offering Price”) to the public, for a total of $12.0\nmillion of gross proceeds to the Company, before deducting underwriting discounts and offering expenses. \n\n \n\nThe Company intends to use\nnet proceeds from the Offering for expansion into new markets, R&D activities to expand its product portfolio, research and development\nactivities, building brand awareness, investment in equipment and infrastructure, and working capital and general corporate purposes.\n\n \n\nThe shares began trading on the NASDAQ Stock Market\nLLC on April 10, 2025, under the symbol “CUPR”.\n\n \n\nR. F. Lafferty & Co., Inc. (“R. F. Lafferty”),\nacted as the sole book-running manager for the Offering. Loeb & Loeb LLP, Lee & Lee, Harney Westwood & Riegels Singapore LLP\nare acting as U.S., Singapore and Cayman Islands legal counsels to the Company, respectively, and Winston & Strawn LLP is acting as\nU.S. legal counsel to R. F. Lafferty for the Offering.\n\n \n\n“We are gratified to\nclose this Offering,” said Cuprina chief executive David Quek. “Our chronic wound care products, we believe, are poised to\ngain escalating market acceptance due primarily to the steadily aging global population and concurrent rise in diabetes, obesity, cardiovascular\nailments and peripheral vascular diseases, all of which are associated with chronic wounds.\n\n \n\n“Our mission is to\ntreat these wounds with sustainable, nature-derived raw materials containing bioactives widely demonstrated in clinical studies to achieve\nsuperior clinical outcomes and reduce costs of care compared to most traditional treatment modalities.”\n\n "
}